app/controllers/api/comments_controller.rb

    def create
      @comment = current_user.authored_comments.new(comment_params)

      if @comment.save
---
INSERT INTO "comments" ("content", "post_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "what's cool?"], ["post_id", 3], ["author_id", 1], ["created_at", "2015-04-08 20:13:38.522217"], ["updated_at", "2015-04-08 20:13:38.522217"]]

    def index
      post = Post.find(params[:post_id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", nil]]