app/controllers/api/friendships_controller.rb

    def create
      @friendship = current_user.friendships_as_requester.new(friendship_params)

      if @friendship.save
---
INSERT INTO "friendships" ("accepted", "requestee_id", "requester_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["accepted", "t"], ["requestee_id", 1], ["requester_id", 3], ["created_at", "2015-04-10 06:26:34.848277"], ["updated_at", "2015-04-10 06:26:34.848277"]]

    def destroy
      @friendship = Friendship.find(params[:id])
      @friendship.destroy!
---
SELECT  "friendships".* FROM "friendships" WHERE "friendships"."id" = $1 LIMIT 1  [["id", 3]]
DELETE FROM "friendships" WHERE "friendships"."id" = $1  [["id", 3]]

    def update
      @friendship = current_user.friendships_as_requestee.find(friendship_params[:id])
      @friendship.update_attributes(accepted: friendship_params[:accepted])
---
SELECT  "friendships".* FROM "friendships" WHERE "friendships"."requestee_id" = $1 AND "friendships"."id" = $2 LIMIT 1  [["requestee_id", 2], ["id", 1]]
UPDATE "friendships" SET "accepted" = $1, "updated_at" = $2 WHERE "friendships"."id" = $3  [["accepted", "t"], ["updated_at", "2015-04-10 15:57:52.677967"], ["id", 1]]