app/controllers/api/likes_controller.rb

SELECT "likes".* FROM "likes" WHERE "likes"."likable_type" = $1  [["likable_type", "Comment"]]
---
    def comment_index
      @likes = Like.where(likable_type: 'Comment')

INSERT INTO "likes" ("user_id", "likable_type", "likable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["likable_type", "Comment"], ["likable_id", 3], ["created_at", "2015-04-11 22:16:59.913518"], ["updated_at", "2015-04-11 22:16:59.913518"]]
---
    def create
      @like = current_user.likes.new(like_params)

      if @like.save

SELECT  "likes".* FROM "likes" WHERE "likes"."id" = $1 LIMIT 1  [["id", 3]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 3]]
---
    def destroy
      @like = Like.find(params[:id])
      @like.destroy!

SELECT "likes".* FROM "likes" WHERE "likes"."likable_type" = $1  [["likable_type", "post"]]
---
    def post_index
      @likes = Like.where(likable_type: 'Post')