app/controllers/api/posts_controller.rb

INSERT INTO "posts" ("content", "picture", "recipient_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "Ricky2"], ["picture", ""], ["recipient_id", 1], ["author_id", 1], ["created_at", "2015-04-09 07:38:53.961700"], ["updated_at", "2015-04-09 07:38:53.961700"]]
---
    def create
      @post = current_user.authored_posts.new(post_params)

      if @post.save

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 2]]
SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = $1  [["author_id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 4]]
SELECT "users".* FROM "users"
---
    def feed
      @posts = current_user.received_posts.includes(:comments).concat(
               current_user.authored_posts.includes(:comments))
      accepted_friendships = friendships_of_current_user.select do |friendship|
        friendship[:accepted]
      end

      accepted_friendships.each do |friendship|
        friend_user = User.find(friendship[:user_id])
        friend_user.authored_posts.each do |post|

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", nil]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 3]]
---
    def index
      user = User.find(params[:user_id])
      @posts = user.received_posts.includes(:comments)